app/controllers/events_controller.rb

SELECT * FROM "events" ORDER BY title ASC
---
  def index
    @events = Event.all

SELECT * FROM "events" WHERE ("events"."id" = 29) ORDER BY title ASC
---
  def show
    @event = Event.find(params[:id])

SELECT * FROM "events" WHERE ("events"."id" = 29) ORDER BY title ASC
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO "events" ("created_at", "title", "timing_details", "updated_at", "class_style", "music_style", "venue_id", "url", "day", "frequency", "description", "event_type", "organiser_id", "pricing_details", "date_array") VALUES('2010-04-05 14:39:34', 'Saturdays', 'Venue open from 10am, Club starts at 8pm, Close 2am', '2010-04-05 14:39:34', '', '1920''s DJs and various LIVE BANDS downstairs, 50''s and Rock and Roll upstairs
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT * FROM "events" WHERE ("events"."id" = 29) ORDER BY title ASC
UPDATE "events" SET "updated_at" = '2010-04-11 13:50:16', "venue_id" = 23, "timing_details" = '7pm Beginners', "date_array" = '---
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])