app/controllers/organisers_controller.rb

  def index
    @organisers = Organiser.all
---
SELECT * FROM "organisers" ORDER BY name ASC

  def show
    @organiser = Organiser.find(params[:id])
---
SELECT * FROM "organisers" WHERE ("organisers"."id" = 9) ORDER BY name ASC

  def create
    @organiser = Organiser.new(params[:organiser])

    respond_to do |format|
      if @organiser.save
---
INSERT INTO "organisers" ("name", "created_at", "updated_at", "website", "description") VALUES('The Last Days of Decadence', '2010-04-05 14:32:25', '2010-04-05 14:32:25', 'http://www.thelastdaysofdecadence.com', '')