app/controllers/venues_controller.rb

  def index
    @venues = Venue.order('name ASC').includes(:events)
---
SELECT * FROM "venues" ORDER BY name, name ASC

  def show
    @venue = Venue.find(params[:id])
---
SELECT * FROM "venues" WHERE ("venues"."id" = 22) ORDER BY name ASC

  def create
    @venue = Venue.new(venue_params)

    if @venue.save
---
INSERT INTO "venues" ("name", "address", "compass", "created_at", "postcode", "updated_at", "area", "nearest_tube", "website") VALUES('The Florence', '50 Florence Street, Angel, London', 'N', '2010-04-11 13:24:33', 'N1 2DU', '2010-04-11 13:24:33', 'Angel', 'Angel', '')