app/controllers/website_controller.rb

SELECT * FROM "events" ORDER BY title ASC LIMIT 1
---
  def index
    # Varnish will cache the page for 3600 seconds = 1 hour:
    response.headers['Cache-Control'] = 'public, max-age=3600'

    @classes = Event.active.weekly_or_fortnightly.classes.includes(:venue, :organiser, :swing_cancellations)